# The Pandas DataFrame Object

A DataFrame represents a ractangler table of data, and contains an ordered collection of columns, each of which can be a different value type.

In [10]:
import numpy as np 
import pandas as pd

In [14]:
#Create a DataFrame from a 2-D ndarray
df = pd.DataFrame(np.array([ [10,11,12,13],[20,21,22,23] ]))
df

    0   1   2   3
0  10  11  12  13
1  20  21  22  23

In [22]:
#Create a DataFrame for a list of series objects
df1 = pd.DataFrame( [pd.Series(np.arange(10, 15)),
                    pd.Series(np.arange(15, 20))] )
df1

    0   1   2   3   4
0  10  11  12  13  14
1  15  16  17  18  19

In [24]:
#Create a DataFrame with two series objects and a dictionary
s1 = pd.Series(np.arange(1, 6, 1))
s2 = pd.Series(np.arange(6, 11, 1))

df2 = pd.DataFrame({'boys': s1, 'girls': s2})
df2

   boys  girls
0     1      6
1     2      7
2     3      8
3     4      9
4     5     10

In [36]:
#Create a DataFrame with dictionary
data = {
            'name':   ["Asad", "Saad", "Fahad", "Ali"], 
            "age":    [23, 34, 23, 21], 
            "grades": ["A", "B", "C", "D"]
       }
data = pd.DataFrame(data)
data

    name  age grades
0   Asad   23      A
1   Saad   34      B
2  Fahad   23      C
3    Ali   21      D

In [37]:
#Specify column name
df3 = pd.DataFrame(np.array([ [10,11], [20,21] ]), columns=["apples", "oranges"])
df3

   apples  oranges
0      10       11
1      20       21

In [38]:
#Create a DataFrame with named columns and rows
df4 = pd.DataFrame(np.array([ [10,11,12,13],[20,21,22,23] ]), index=['apples', 'oranges'], columns=['Mon', 'Tue', 'Wed', 'Thu'])
df4

         Mon  Tue  Wed  Thu
apples    10   11   12   13
oranges   20   21   22   23